//
// Created by rudnf on 2023-03-05.
//
#include <iostream>
#include <iomanip>
using namespace std;

int main(){
    /* 01 사용자로부터 부호 없는 두 자리 정수를 입력받고, 자리수의 값을 바꿔서 출력하는 프로그램*/
    /* 02 3개의 정수를 입력받고, 가장 작은 것을 출력하는 프로그램*/
    /* 03 사용자로부터 1~12사이의 숫자를 입력받고 해당 월을 January, February, ..., December와 같은 형태의영어로 출력하는 프로그램*/
    /* 04 차량의 종류(일반 승용차는 'c', 버스는 'b', 트럭은't')와 주차장에서 차량이 있던 시간을 입력받은 뒤, 다음과 같은 주차 요금에 따라서 요금을 계산하는 프로그램
     *     일반 승용차: 시간당 2달러  |  버스: 시간당 3달러  | 트럭: 시간당 4달러 */
    /* 05 학생의 점수를 기반으로 학점을 구하는 프로그램(기준 책 참고)*/
    /* 06 대학교에서 학생의 총 수업료를 계산하고 출력하는 프로그램. 학생들은 최대 12학점에 대해 학점당 10달러의 수수료 지불. 12학점을 넘는 분량은 수수료 없음. 등록비는 학생당 10달러*/
    /* 07 도매점에서 물건을 구매할 때, 다음과 같이 수량에 따라서 추가적인 할인이 들어감. 물건 하나의 가격과 구매 수량을 입력받고 할인이 적용된 전체 가격을 출력하는 프로그램
     *    수량 1~9개(할인율 0%) | 10~49개(할인율 3%) | 50~99개(할인율 5%) | 100개이상 (할인율 10%) */
    /* 08 */
    /* 09 */
    /* 10 */
    /* 11 */



    return 0;
}
